# AnalyticalSurfaceCannotMove Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..AnalyticalModelFailures..::..AnalyticalSurfaceCannotMove Property
BuiltInFailures..::..AnalyticalModelFailures Class See Also
---
Cannot move analytical surface.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId AnalyticalSurfaceCannotMove { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AnalyticalSurfaceCannotMove As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ AnalyticalSurfaceCannotMove {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace